diagrams/010-haute-dispo.puml
@startuml

skinparam package {
    BackgroundColor #fff
    BorderColor #bbb
    BorderThickness 2
    FontColor #326ce5
    TitleFontColor #326ce5
}
skinparam node {
    BackgroundColor #326ce5
    BorderColor white
    BorderThickness 4
    FontColor white
}

package "Répartiteur" as LB {
  node "LB" as vip
}

package "zoneA" as zoneA {
  node "Node1" as n1
}

package "zoneB" as zoneB {
  node "Node2" as n2
}

vip -> n1
vip -> n2
n1 .. n2

@enduml
